Tekla Open API Reference for Tekla Structures 2025
IsComponent Methods
The ObjectFilterExpressions.IsComponent type exposes the following members.
Methods
Name | Description
ToString
 Creates a string representation of the current object.
 (Inherited from DataFilterExpression.)
Top
See Also
Reference
ObjectFilterExpressions.IsComponent Class
Tekla.Structures.Filtering.Categories Namespace